#### Exercise_Part_02: Data Indexing & Selection

##### *Exercise_01*
- _1. For the data given below, construct the DataFrame object._
- _2. Get the first 4 rows of the DataFrame using the indexing method._

In [125]:
import pandas as pd
import numpy as np

In [126]:
exam_data = {
    'name': ['Anjum', 'Anali', 'Souria', 'Rockea', 'Imani', 'Mouliya', 'Julie', 'Rana', 'Kavin', 'Bosia'],
    'score': [15.5, 9, 16.5, np.nan, 9, 30, 17.5, np.nan, 8, 20],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}

labels = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [127]:
# DataFrame
exam_df = pd.DataFrame(exam_data, index= labels)
exam_df

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.5         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin    8.0         2      no
J    Bosia   20.0         1     yes

In [128]:
# First 4 rows
first_4rows = exam_df.loc['A':'D'] # using explicit indexing
first_4rows

     name  score  attempts qualify
A   Anjum   15.5         1     yes
B   Anali    9.0         3      no
C  Souria   16.5         2     yes
D  Rockea    NaN         3      no

In [129]:
first_4_rows = exam_df.iloc[:4] # using implicit indexing
first_4_rows

     name  score  attempts qualify
A   Anjum   15.5         1     yes
B   Anali    9.0         3      no
C  Souria   16.5         2     yes
D  Rockea    NaN         3      no

##### *Exercise_02*
##### _For the DataFrame created in exercise_01:_
- _1. Select the columns 'score'and 'attempts' in rows 1, 3, 5, 7._
- _2. Count the number of rows and columns without using the shape attribute._
- _3. Select the rows where the score is between 16 and 20._
- _4. Select the rows where the number of attempts in the examination is less than 2 and score greater than 16._

In [130]:
print(exam_df)

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.5         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin    8.0         2      no
J    Bosia   20.0         1     yes

In [131]:
# score & attempts columns in rows 1, 3, 5, 7
# df2 = exam_df.iloc[1:8:2][['score', 'attempts']]
df2 = exam_df.iloc[[1, 3, 5, 7], [1, 2]]
df2

   score  attempts
B    9.0         3
D    NaN         3
F   30.0         3
H    NaN         1

In [132]:
# no.of rows & columns without the shape attribute

# no_of_rows = len(exam_df.index)
# no_of_columns = len(exam_df.columns)

no_of_rows = len(exam_df.axes[0])
no_of_columns = len(exam_df.axes[1])
print(f'rows: {no_of_rows}, cols: {no_of_columns}')

rows: 10, cols: 4

In [133]:
# rows where the score is btn 16 & 20
# condition = (exam_df['score'] >= 16) & (exam_df['score'] <= 20)

selection = exam_df['score'].between(16, 20)
print(exam_df[selection])

     name  score  attempts qualify
C  Souria   16.5         2     yes
G   Julie   17.5         1     yes
J   Bosia   20.0         1     yes

In [134]:
# rows where the no.of attempts is less than 2 and score greater than 16
filter_condition = (exam_df['attempts'] < 2) & (exam_df['score'] > 16)
print(exam_df[filter_condition])

    name  score  attempts qualify
G  Julie   17.5         1     yes
J  Bosia   20.0         1     yes

##### *Exercise_03*
##### _For the DataFrame created in exercise_01:_
- _1. Change the score of rows 'C' and 'I' to 16._
- _2. Calculate the sum of the examination attempts by the students._
- _3. Add a new row with the details: name : Rupai, score: 16, attempts : 2, qualfify: yes, label : L. After adding the new row, display it and then remove it to maintain the original dataframe._
- _4. Remove the last 4 rows and save it as a new dataframe._

In [142]:
# scores of row C and I to 16
exam_df.loc[['C', 'I'], 'score'] = 16
print(exam_df)

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.0         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin   16.0         2      no
J    Bosia   20.0         1     yes

In [136]:
# sum of examination attempts by students
sum_attempts = exam_df['attempts'].sum()
print('Total attempts:', sum_attempts)

Total attempts: 19

In [ ]:
# new row
# new_data = {
#     'name': 'Rupai', 
#     'score': 16,
#     'attempts': 2,
#     'qualify': 'yes'
# }

# label = ['L']

# new_data_df = pd.DataFrame(new_data, index= label)

# new_exam_df = pd.concat([exam_df, new_data_df])

exam_df.loc['L'] = ['Rupai', '16', 2, 'yes']
print(exam_df)

      name score  attempts qualify
A    Anjum  15.5         1     yes
B    Anali   9.0         3      no
C   Souria  16.0         2     yes
D   Rockea   NaN         3      no
E    Imani   9.0         2      no
F  Mouliya  30.0         3     yes
G    Julie  17.5         1     yes
H     Rana   NaN         1      no
I    Kavin  16.0         2      no
J    Bosia  20.0         1     yes
L    Rupai    16         2     yes

In [ ]:
# removing the newly entered row to maintain the original dataframe
# exam_df2 = new_exam_df.drop(index= 'L', inplace=True)
exam_df2 = exam_df.iloc[:-1, :]

print(exam_df2)

      name score  attempts qualify
A    Anjum  15.5         1     yes
B    Anali   9.0         3      no
C   Souria  16.0         2     yes
D   Rockea   NaN         3      no
E    Imani   9.0         2      no
F  Mouliya  30.0         3     yes
G    Julie  17.5         1     yes
H     Rana   NaN         1      no
I    Kavin  16.0         2      no
J    Bosia  20.0         1     yes

In [139]:
# remove the last 4 rows and save it as a new data frame
exam_df_new = exam_df.iloc[:-4]
print(exam_df_new)

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.0         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes